duxinglang-1/nRF5340_test/N2_NCS2.7.0_TEST/src/ppg/max_sh_interface.c
/****************************************Copyright (c)************************************************
** File Name:			    max_sh_interface.c
** Descriptions:			max sensor hub interface source file
** Created By:				xie biao
** Created Date:			2021-06-21
** Modified Date:      		2021-06-21 
** Version:			    	V1.0
******************************************************************************************************/
#include <zephyr/kernel.h>
#include <zephyr/device.h>
#include <zephyr/drivers/i2c.h>
#include <zephyr/drivers/gpio.h>
#include "max32674.h"
#include "max_sh_interface.h"
#include "max_sh_api.h"
#include "settings.h"
#include "uart.h"
#include "logger.h"

//#define MAX_DEBUG

#define MAX630FTHR       1
#define ME15_DEV_MRD103  0
#define ME15_DEV_OB7     0

#if MAX630FTHR
#define SH_RST_PORT                	"GPIO_0"
#define SH_RST_PIN            		16
#define SH_MFIO_PORT           	    "GPIO_0"
#define SH_MFIO_PIN            		14
#elif ME15_DEV_MRD103
#define SH_RST_PORT                 "GPIO_0"
#define SH_RST_PIN            		16
#define SH_MFIO_PORT           	    "GPIO_0"
#define SH_MFIO_PIN            		14
#elif ME15_DEV_OB7
#define SH_RST_PORT                 "GPIO_0"
#define SH_RST_PIN            		16
#define SH_MFIO_PORT           	    "GPIO_0"
#define SH_MFIO_PIN            		14
#endif

#if DT_NODE_HAS_STATUS(DT_NODELABEL(i2c2), okay)
#define PPG_DEV DT_NODELABEL(i2c2)
#else
#error "i2c2 devicetree node is disabled"
#define PPG_DEV	""
#endif

#if DT_NODE_HAS_STATUS(DT_NODELABEL(gpio0), okay)
#define PPG_PORT0 DT_NODELABEL(gpio0)
#else
#error "gpio0 devicetree node is disabled"
#define PPG_PORT0	""
#endif
#if DT_NODE_HAS_STATUS(DT_NODELABEL(gpio1), okay)
#define PPG_PORT1 DT_NODELABEL(gpio1)
#else
#error "gpio1 devicetree node is disabled"
#define PPG_PORT1	""
#endif


#define PPG_SDA_PIN		5
#define PPG_SCL_PIN		4
#define PPG_INT_PIN		13
#define PPG_MFIO_PIN	23
#define PPG_RST_PIN		25
#define PPG_EN0_PIN		10	//给32674供电
#define PPG_EN1_PIN		19	//给86176供电

#define PPG_I2C_CON_PIN	8
#define PPG_SPI_CON_PIN	29


#define MAX32674_I2C_ADD     0x55
	
#ifdef DT_ALIAS_SW0_GPIOS_FLAGS
#define PULL_UP DT_ALIAS_SW0_GPIOS_FLAGS
#else
#define PULL_UP 0
#endif
#define EDGE (GPIO_INT_EDGE | GPIO_INT_DOUBLE_EDGE)

#define MFIO_LOW_DURATION        1500
#define SS_DEFAULT_RETRIES       ((int) (5))
#define SH_BPT_CAL_COUNT_MAX	(5)

//max size is used for bootloader page loading
#define SS_TX_BUF_SIZE		(BL_MAX_PAGE_SIZE+BL_AES_AUTH_SIZE+BL_FLASH_CMD_LEN)

static struct device *i2c_ppg = NULL;
static struct device *gpio_0_ppg = NULL;
static struct device *gpio_1_ppg = NULL;

static struct gpio_callback gpio_cb;

uint8_t sh_write_buf[SS_TX_BUF_SIZE]={0};
uint8_t sh_bpt_cal[CAL_RESULT_SIZE]={0};

extern bool ppg_int_event;
extern uint8_t g_ppg_bpt_status;
extern uint8_t g_ppg_ver[64];

void wait_us(int us)
{
	k_sleep(K_MSEC(1));
}

void wait_ms(int ms)
{
	k_sleep(K_MSEC(ms));
}

void PPG_Enable(void)
{
	gpio_pin_configure(gpio_1_ppg, PPG_EN0_PIN, GPIO_OUTPUT);
	gpio_pin_set(gpio_1_ppg, PPG_EN0_PIN, 1);
	gpio_pin_configure(gpio_0_ppg, PPG_EN1_PIN, GPIO_OUTPUT);
	gpio_pin_set(gpio_0_ppg, PPG_EN1_PIN, 1);
	
	k_sleep(K_MSEC(20));

	gpio_pin_configure(gpio_0_ppg, PPG_SPI_CON_PIN, GPIO_OUTPUT);
	gpio_pin_set(gpio_0_ppg, PPG_SPI_CON_PIN, 0);
	gpio_pin_configure(gpio_1_ppg, PPG_I2C_CON_PIN, GPIO_OUTPUT);
	gpio_pin_set(gpio_1_ppg, PPG_I2C_CON_PIN, 1);

	gpio_pin_configure(gpio_0_ppg, PPG_RST_PIN, GPIO_OUTPUT);
	gpio_pin_set(gpio_0_ppg, PPG_RST_PIN, 1);
}

void PPG_Disable(void)
{
	gpio_pin_configure(gpio_1_ppg, PPG_EN0_PIN, GPIO_OUTPUT);
	gpio_pin_set(gpio_1_ppg, PPG_EN0_PIN, 0);
	gpio_pin_configure(gpio_0_ppg, PPG_EN1_PIN, GPIO_OUTPUT);
	gpio_pin_set(gpio_0_ppg, PPG_EN1_PIN, 0);
	
	gpio_pin_configure(gpio_0_ppg, PPG_SPI_CON_PIN, GPIO_OUTPUT);
	gpio_pin_set(gpio_0_ppg, PPG_SPI_CON_PIN, 0);
	gpio_pin_configure(gpio_1_ppg, PPG_I2C_CON_PIN, GPIO_OUTPUT);
	gpio_pin_set(gpio_1_ppg, PPG_I2C_CON_PIN, 0);

	gpio_pin_configure(gpio_0_ppg, PPG_RST_PIN, GPIO_OUTPUT);
	gpio_pin_set(gpio_0_ppg, PPG_RST_PIN, 0);
	gpio_pin_configure(gpio_0_ppg, PPG_MFIO_PIN, GPIO_OUTPUT);
	gpio_pin_set(gpio_0_ppg, PPG_MFIO_PIN, 0);
}

static void sh_init_i2c(void)
{
	i2c_ppg = DEVICE_DT_GET(PPG_DEV);
	if(!i2c_ppg)
	{
	#ifdef MAX_DEBUG
		LOGD("ERROR SETTING UP I2C");
	#endif
	}
	else
	{
		i2c_configure(i2c_ppg, I2C_SPEED_SET(I2C_SPEED_FAST));
	}
}

static void interrupt_event(struct device *interrupt, struct gpio_callback *cb, uint32_t pins)
{
	ppg_int_event = true; 
}

static void sh_init_gpio(void)
{
	gpio_flags_t flag = GPIO_INPUT|GPIO_PULL_UP;

	if(gpio_0_ppg == NULL)
		gpio_0_ppg = DEVICE_DT_GET(PPG_PORT0);
	if(gpio_1_ppg == NULL)
		gpio_1_ppg = DEVICE_DT_GET(PPG_PORT1);

	gpio_pin_configure(gpio_1_ppg, PPG_EN0_PIN, GPIO_OUTPUT);
	gpio_pin_set(gpio_1_ppg, PPG_EN0_PIN, 1);
	gpio_pin_configure(gpio_0_ppg, PPG_EN1_PIN, GPIO_OUTPUT);
	gpio_pin_set(gpio_0_ppg, PPG_EN1_PIN, 1);
	
	k_sleep(K_MSEC(20));

	gpio_pin_configure(gpio_0_ppg, PPG_SPI_CON_PIN, GPIO_OUTPUT);
	gpio_pin_set(gpio_0_ppg, PPG_SPI_CON_PIN, 0);
	gpio_pin_configure(gpio_1_ppg, PPG_I2C_CON_PIN, GPIO_OUTPUT);
	gpio_pin_set(gpio_1_ppg, PPG_I2C_CON_PIN, 1);

	//PPG模式选择(bootload\application)
	gpio_pin_configure(gpio_0_ppg, PPG_RST_PIN, GPIO_OUTPUT);
	gpio_pin_configure(gpio_0_ppg, PPG_MFIO_PIN, GPIO_OUTPUT);
}

void SH_mfio_to_low_and_keep(int waitDurationInUs)
{
	gpio_pin_set(gpio_0_ppg, PPG_MFIO_PIN, 0);
	wait_us(waitDurationInUs);
}

void SH_pull_mfio_to_high (void)
{
	gpio_pin_set(gpio_0_ppg, PPG_MFIO_PIN, 1);
}

void SH_rst_to_BL_mode(void)
{
	//set all high
	gpio_pin_set(gpio_0_ppg, PPG_RST_PIN, 1);
	gpio_pin_set(gpio_0_ppg, PPG_MFIO_PIN, 1);
	k_sleep(K_MSEC(10));

	//set mfio low
	gpio_pin_set(gpio_0_ppg, PPG_MFIO_PIN, 0);
	k_sleep(K_MSEC(10));

	//reset sensor hub
	gpio_pin_set(gpio_0_ppg, PPG_RST_PIN, 0);
	k_sleep(K_MSEC(100));
	gpio_pin_set(gpio_0_ppg, PPG_RST_PIN, 1);
	
	//enter bootloader mode
	int s32_status = sh_put_in_bootloader();
	if(s32_status != SS_SUCCESS)
	{
	#ifdef MAX_DEBUG
		LOGD("set bl mode fail, %x", s32_status);
	#endif
		return;
	}

	k_sleep(K_MSEC(50));
	gpio_pin_set(gpio_0_ppg, PPG_MFIO_PIN, 1);

#ifdef MAX_DEBUG
	LOGD("set bl mode success!");
#endif
}

