duxinglang-1/nRF5340_test/N2_NCS2.7.0_TEST/src/ppg/max_sh_interface.c
void SH_set_to_APP_mode(void)
{
	//set rst low and mfio high
	gpio_pin_set(gpio_0_ppg, PPG_RST_PIN, 0);
	gpio_pin_set(gpio_0_ppg, PPG_MFIO_PIN, 1);
	wait_ms(10);

	//set rst high
	gpio_pin_set(gpio_0_ppg, PPG_RST_PIN, 1);
	wait_ms(50);
	
	//enter application mode end delay for initialization finishes
	//Delay 2000ms by timer to prevent the system from crashing due to sleep.
	//wait_ms(2000);
}

void SH_rst_to_APP_mode(void)
{
	//set rst low and mfio high
	gpio_pin_set(gpio_0_ppg, PPG_RST_PIN, 0);
	gpio_pin_set(gpio_0_ppg, PPG_MFIO_PIN, 1);
	wait_ms(10);

	//set rst high
	gpio_pin_set(gpio_0_ppg, PPG_RST_PIN, 1);
	wait_ms(50);
	
	//enter application mode end delay for initialization finishes
	wait_ms(2000);

#ifdef MAX_DEBUG	
	LOGD("rst app mode success!");
#endif
}

void SH_to_APP_from_BL_timing_out(void)
{
	//set rst and mfio low
	gpio_pin_set(gpio_0_ppg, PPG_RST_PIN, 0);
	gpio_pin_set(gpio_0_ppg, PPG_MFIO_PIN, 0);
	k_sleep(K_MSEC(10));

	//set rst high
	gpio_pin_set(gpio_0_ppg, PPG_RST_PIN, 1);
	k_sleep(K_MSEC(50));

	//If no I2C commands are sent to the AlgoHub within the next 1s, 
	//then the AlgoHub will automatically switch to application mode.
}

/**
 * @brief	   Read data from BPT sensor
 * @retval	   SS_SUCCESS  if everything is successful, others	communication error
 */
int sh_read_cmd(uint8_t *cmd_bytes,
				int cmd_bytes_len,
				uint8_t *data,
				int data_len,
				uint8_t *rxbuf,
				int rxbuf_sz,
				int sleep_ms )
{

	int retries = SS_DEFAULT_RETRIES;

	SH_mfio_to_low_and_keep(MFIO_LOW_DURATION);
	int ret = i2c_write(i2c_ppg, cmd_bytes, cmd_bytes_len, MAX32674_I2C_ADD);
	SH_pull_mfio_to_high();

	while((ret != 0) && (retries-- > 0))
	{
		WAIT_MS(1);

		SH_mfio_to_low_and_keep(MFIO_LOW_DURATION);
		ret = i2c_write(i2c_ppg, cmd_bytes, cmd_bytes_len, MAX32674_I2C_ADD);
		SH_pull_mfio_to_high();
	}

	if(retries == 0)
		return SS_ERR_UNAVAILABLE;


	WAIT_MS(sleep_ms);

	SH_mfio_to_low_and_keep(MFIO_LOW_DURATION);
	ret = i2c_read(i2c_ppg, rxbuf, rxbuf_sz, MAX32674_I2C_ADD);
	SH_pull_mfio_to_high();

	bool try_again = (rxbuf[0] == SS_ERR_TRY_AGAIN);

	while((ret != 0 || (try_again)) && (retries-- > 0))
	{
		WAIT_MS(sleep_ms);

		SH_mfio_to_low_and_keep(MFIO_LOW_DURATION);
		ret = i2c_read(i2c_ppg, rxbuf, rxbuf_sz, MAX32674_I2C_ADD);
		SH_pull_mfio_to_high();

		try_again = (rxbuf[0] == SS_ERR_TRY_AGAIN);
	}

	if(ret != 0 || (rxbuf[0] == SS_ERR_TRY_AGAIN))
		return SS_ERR_UNAVAILABLE;

	if(rxbuf[0] == 0xAA)
	{
		rxbuf[0] = SS_SUCCESS;
	}

	return (int)((SS_STATUS)rxbuf[0]);
}

int sh_write_cmd_without_status_cb(uint8_t *tx_buf,
								   int tx_len,
				 				   int sleep_ms)
{
	int retries = SS_DEFAULT_RETRIES;

	SH_mfio_to_low_and_keep(MFIO_LOW_DURATION);
	int ret = i2c_write(i2c_ppg, tx_buf, tx_len, MAX32674_I2C_ADD);
	SH_pull_mfio_to_high();

	while((ret != 0) && (retries--) > 0)
	{
		WAIT_MS(1);
		SH_mfio_to_low_and_keep(MFIO_LOW_DURATION);
		ret = i2c_write(i2c_ppg, tx_buf, tx_len, MAX32674_I2C_ADD);
		SH_pull_mfio_to_high();
	}

	if((ret != 0) && (retries == 0))
	{
	   return SS_ERR_UNAVAILABLE;
	}
}

int sh_write_cmd(uint8_t *tx_buf,
				 int tx_len,
				 int sleep_ms)
{
	int retries = SS_DEFAULT_RETRIES;

	SH_mfio_to_low_and_keep(MFIO_LOW_DURATION);
	int ret = i2c_write(i2c_ppg, tx_buf, tx_len, MAX32674_I2C_ADD);
	SH_pull_mfio_to_high();

	while((ret != 0) && (retries--) > 0)
	{
		WAIT_MS(1);
		SH_mfio_to_low_and_keep(MFIO_LOW_DURATION);
		ret = i2c_write(i2c_ppg, tx_buf, tx_len, MAX32674_I2C_ADD);
		SH_pull_mfio_to_high();
	}

	if((ret != 0) && (retries == 0))
	{
	   return SS_ERR_UNAVAILABLE;
	}

	WAIT_MS(sleep_ms);

	uint8_t status_byte;
	SH_mfio_to_low_and_keep(MFIO_LOW_DURATION);
	ret = i2c_read(i2c_ppg, (uint8_t*)&status_byte, 1, MAX32674_I2C_ADD);
	SH_pull_mfio_to_high();

	bool try_again = (status_byte == SS_ERR_TRY_AGAIN);

	while((ret != 0 || (try_again)) && (retries--) > 0)
	{
		WAIT_MS(sleep_ms);

		SH_mfio_to_low_and_keep(MFIO_LOW_DURATION);
		ret = i2c_read(i2c_ppg, (uint8_t*)&status_byte, 1, MAX32674_I2C_ADD);
		SH_pull_mfio_to_high();

		try_again = (status_byte == SS_ERR_TRY_AGAIN);
	}

	if (ret != 0 || try_again)
	{
		return SS_ERR_UNAVAILABLE;
	}

	if (status_byte == 0xAA || status_byte == 0xAB)
	{
		status_byte = SS_SUCCESS;
	}

	return (int)((SS_STATUS)status_byte);
}

int sh_write_cmd_with_data(uint8_t *cmd_bytes,
						   int cmd_bytes_len,
						   uint8_t *data,
						   int data_len,
						   int cmd_delay_ms)
{
	memcpy(sh_write_buf, cmd_bytes, cmd_bytes_len);
	memcpy(sh_write_buf+cmd_bytes_len, data, data_len);
	int status = sh_write_cmd(sh_write_buf, cmd_bytes_len+data_len, cmd_delay_ms);
	return status;
}

int32_t sh_enter_int_mode(void)
{
	uint8_t ByteSeq[] =  {0xB8,0x01};
	int status = sh_write_cmd( &ByteSeq[0],sizeof(ByteSeq), SS_DEFAULT_CMD_SLEEP_MS);
    return status;
}

int32_t sh_enter_polling_mode(void)
{
	uint8_t ByteSeq[] =  {0xB8,0x00};
	int status = sh_write_cmd( &ByteSeq[0],sizeof(ByteSeq), SS_DEFAULT_CMD_SLEEP_MS);
    return status;
}

int32_t sh_get_sensorhub_operating_mode(uint8_t *hubMode)
{

	uint8_t ByteSeq[] = {0x02,0x00};
	uint8_t rxbuf[2]  = { 0 };

	int status = sh_read_cmd(&ByteSeq[0], sizeof(ByteSeq),
			                    0, 0,
			                    &rxbuf[0], sizeof(rxbuf),
								SS_DEFAULT_CMD_SLEEP_MS);

	*hubMode = rxbuf[1];
	return status;
}


int32_t sh_get_hub_fw_version(uint8_t* fw_version)
{
	uint8_t u8_work_mode;
	uint8_t cmd_bytes[2];
	uint8_t rxbuf[4];
	uint32_t status;

	sh_get_sensorhub_operating_mode(&u8_work_mode);

	if(u8_work_mode > 0)
	{
		cmd_bytes[0] = SS_FAM_R_BOOTLOADER;
		cmd_bytes[1] = SS_CMDIDX_BOOTFWVERSION;
	}
	else if(u8_work_mode == 0)
	{
		cmd_bytes[0] = SS_FAM_R_IDENTITY;
		cmd_bytes[1] = SS_CMDIDX_FWVERSION;
	}
	else
	{
		return status;
	}

	status = sh_read_cmd(&cmd_bytes[0], sizeof(cmd_bytes),
							0, 0,
							&rxbuf[0], sizeof(rxbuf),
							SS_DEFAULT_CMD_SLEEP_MS );

	memcpy(fw_version, &rxbuf[1],sizeof(rxbuf) - 1);
	return status;
}

int sh_set_sensorhub_active(void)
{
	gpio_pin_set(gpio_0_ppg, PPG_INT_PIN, 0);
	k_sleep(K_MSEC(10));
	gpio_pin_set(gpio_0_ppg, PPG_INT_PIN, 1);
}

int sh_set_sensorhub_sleep(void)
{
	uint8_t ByteSeq[] = {0x04,0x00,0x02};
	
