duxinglang-1/nRF5340_test/N2_NCS2.7.0_TEST/src/ppg/max_sh_interface.c
	int status = sh_write_cmd( &ByteSeq[0], sizeof(ByteSeq), SS_DEFAULT_CMD_SLEEP_MS);
    return status;
}

int sh_set_sensorhub_shutdown(void)
{
#if 0
	uint8_t ByteSeq[] = {0x01,0x00,0x01};
	int status = sh_write_cmd_without_status_cb(&ByteSeq[0],sizeof(ByteSeq), SS_DEFAULT_CMD_SLEEP_MS);
	return status;
#else
	return 0;
#endif	
}

int sh_set_sensorhub_operating_mode(uint8_t hubMode)
{
	uint8_t ByteSeq[] = {0x01,0x00,hubMode};
	int status = sh_write_cmd( &ByteSeq[0],sizeof(ByteSeq), SS_DEFAULT_CMD_SLEEP_MS);
    return status;
}

int sh_get_sensorhub_status(uint8_t *hubStatus)
{
	uint8_t ByteSeq[] = {0x00,0x00};
	uint8_t rxbuf[2]  = { 0 };

	int status = sh_read_cmd(&ByteSeq[0], sizeof(ByteSeq),
			                    0, 0,
			                    &rxbuf[0], sizeof(rxbuf),
								SS_DEFAULT_CMD_SLEEP_MS);

	*hubStatus = rxbuf[1];
	return status;
}

int sh_set_data_type(int data_type_, bool sc_en_)
{

	uint8_t cmd_bytes[] = { 0x10, 0x00 };
	uint8_t data_bytes[] = { (uint8_t)((sc_en_ ? SS_MASK_OUTPUTMODE_SC_EN : 0) |
							((data_type_ << SS_SHIFT_OUTPUTMODE_DATATYPE) & SS_MASK_OUTPUTMODE_DATATYPE)) };

	int status = sh_write_cmd_with_data(&cmd_bytes[0], sizeof(cmd_bytes),
								&data_bytes[0], sizeof(data_bytes),
								SS_DEFAULT_CMD_SLEEP_MS);
	return status;
}

int sh_get_data_type(int *data_type_, bool *sc_en_)
{
	uint8_t ByteSeq[] = {0x11,0x00};
	uint8_t rxbuf[2]  = {0};

	int status = sh_read_cmd( &ByteSeq[0], sizeof(ByteSeq),
							  0, 0,
							  &rxbuf[0], sizeof(rxbuf),
							  SS_DEFAULT_CMD_SLEEP_MS);
	if (status == 0x00 /*SS_SUCCESS*/) {
		*data_type_ =
			(rxbuf[1] & SS_MASK_OUTPUTMODE_DATATYPE) >> SS_SHIFT_OUTPUTMODE_DATATYPE;
		*sc_en_ =
			(bool)((rxbuf[1] & SS_MASK_OUTPUTMODE_SC_EN) >> SS_SHIFT_OUTPUTMODE_SC_EN);

	}

	return status;
}

int sh_set_fifo_thresh(int threshold)
{
	uint8_t cmd_bytes[]  = { 0x10 , 0x01 };
	uint8_t data_bytes[] = { (uint8_t)threshold };

	int status = sh_write_cmd_with_data(&cmd_bytes[0], sizeof(cmd_bytes),
								&data_bytes[0], sizeof(data_bytes),
								SS_DEFAULT_CMD_SLEEP_MS
	                            );
	return status;
}

int sh_get_fifo_thresh(int *thresh)
{
	uint8_t ByteSeq[] = {0x11,0x01};
	uint8_t rxbuf[2]  = {0};

	int status = sh_read_cmd(&ByteSeq[0], sizeof(ByteSeq),
							 0, 0,
							 &rxbuf[0], sizeof(rxbuf),
							 SS_DEFAULT_CMD_SLEEP_MS);

	*thresh = (int) rxbuf[1];
	return status;
}

int sh_ss_comm_check(void)
{
	uint8_t ByteSeq[] = {0xFF, 0x00};
	uint8_t rxbuf[2];

	int status = sh_read_cmd( &ByteSeq[0], sizeof(ByteSeq),
							  0, 0,
							  &rxbuf[0], sizeof(rxbuf),
							  SS_DEFAULT_CMD_SLEEP_MS );

	int tries = 4;
	while(status == SS_ERR_TRY_AGAIN && tries--)
	{
		WAIT_MS(1000);
		status = sh_read_cmd( &ByteSeq[0], sizeof(ByteSeq),
									  0, 0,
									  &rxbuf[0], sizeof(rxbuf),
									  SS_DEFAULT_CMD_SLEEP_MS);

	}

	return status;
}

int sh_num_avail_samples(int *numSamples)
{

	 uint8_t ByteSeq[] = {0x12,0x00};
	 uint8_t rxbuf[2]  = {0};

	 int status = sh_read_cmd(&ByteSeq[0], sizeof(ByteSeq),
							  0, 0,
							  &rxbuf[0], sizeof(rxbuf),
							  1);

	 *numSamples = (int) rxbuf[1];

	 return status;
}

int sh_read_fifo_data(int numSamples, int sampleSize, uint8_t* databuf, int databufSz)
{
	int bytes_to_read = numSamples * sampleSize + 1; //+1 for status byte
	uint8_t ByteSeq[] = {0x12,0x01};

	int status = sh_read_cmd(&ByteSeq[0], sizeof(ByteSeq),
							 0, 0,
							 databuf, bytes_to_read,
							 2);

	return status;
}

int sh_set_reg(int idx, uint8_t addr, uint32_t val, int regSz)
{
	uint8_t ByteSeq[] = { 0x40 , ((uint8_t)idx) , addr};
	uint8_t data_bytes[4];

	for(int i = 0; i < regSz; i++)
	{
		data_bytes[i] = (val >> (8 * (regSz - 1)) & 0xFF);
	}
	
	int status = sh_write_cmd_with_data( &ByteSeq[0], sizeof(ByteSeq),
							             &data_bytes[0], (uint8_t) regSz,
										 SS_DEFAULT_CMD_SLEEP_MS);

    return status;
}

int sh_get_reg(int idx, uint8_t addr, uint32_t *val)
{
	uint32_t i32tmp;
	uint8_t ByteSeq[] = { 0x42, ((uint8_t) idx)};
	uint8_t rxbuf[3]  = {0};

	int status = sh_read_cmd(&ByteSeq[0], sizeof(ByteSeq),
								0, 0,
							 &rxbuf[0], sizeof(rxbuf),
							 SS_DEFAULT_CMD_SLEEP_MS);

    if(status == 0x00 /* SS_SUCCESS */)
    {
    	int reg_width = rxbuf[1];
    	uint8_t ByteSeq2[] = { 0x41, ((uint8_t)idx) , addr} ;
    	uint8_t rxbuf2[5]  = {0};

    	status = sh_read_cmd(&ByteSeq2[0], sizeof(ByteSeq2),
    						0, 0,
    						&rxbuf2[0], reg_width + 1,
							SS_DEFAULT_CMD_SLEEP_MS);

    	if(status == 0x00  /* SS_SUCCESS */)
		{
    		i32tmp = 0;
    		for(int i = 0;i < reg_width;i++)
    		{
    			i32tmp = (i32tmp << 8) | rxbuf2[i + 1];
    		}
            *val = i32tmp;
    	}
    }
    else
    {
    #ifdef MAX_DEBUG
    	LOGD("read register wideth fail");
    #endif
    }

    return status;
}

int sh_spi_release()
{
	uint8_t ByteSeq[] =  {SS_FAM_W_SPI_SELECT, SS_CMDIDX_SPI_RELASE};
	int status = sh_write_cmd( &ByteSeq[0],sizeof(ByteSeq), SS_DEFAULT_CMD_SLEEP_MS);
    return status;
}


int sh_spi_use()
{
	uint8_t ByteSeq[] =  {SS_FAM_W_SPI_SELECT, SS_CMDIDX_SPI_USE};
	int status = sh_write_cmd( &ByteSeq[0],sizeof(ByteSeq), SS_DEFAULT_CMD_SLEEP_MS);
    return status;
}


int sh_spi_status(uint8_t * spi_status)
{
	uint8_t ByteSeq[] =  {SS_FAM_R_SPI_SELECT};

	uint8_t rxbuf[2]  = { 0 };

	int status = sh_read_cmd(&ByteSeq[0], sizeof(ByteSeq),
			                    0, 0,
			                    &rxbuf[0], sizeof(rxbuf),
								SS_DEFAULT_CMD_SLEEP_MS);

	*spi_status = rxbuf[1];
	return status;
}

int sh_sensor_enable_(int idx, int mode, uint8_t ext_mode)
{
	uint8_t ByteSeq[] = {0x44, (uint8_t)idx, (uint8_t)mode, ext_mode};

	int status = sh_write_cmd( &ByteSeq[0],sizeof(ByteSeq), 5 * SS_ENABLE_SENSOR_SLEEP_MS);
    return status;
}

int sh_sensor_disable(int idx)
{
	uint8_t ByteSeq[] = {0x44, ((uint8_t) idx), 0x00};

	int status = sh_write_cmd( &ByteSeq[0],sizeof(ByteSeq), SS_ENABLE_SENSOR_SLEEP_MS);
	return status;
}

int sh_get_input_fifo_size(int *fifo_size)
{
	uint8_t ByteSeq[] = {0x13,0x01};
	uint8_t rxbuf[3]; /* status + fifo size */

