duxinglang-1/nRF5340_test/N2_NCS2.7.0_TEST/src/ppg/max_sh_interface.c
	int status = sh_read_cmd(&ByteSeq[0], sizeof(ByteSeq),
							  0, 0,
							  rxbuf, sizeof(rxbuf), 2*SS_DEFAULT_CMD_SLEEP_MS);

	*fifo_size = rxbuf[1] << 8 | rxbuf[2];
	return status;
}

int sensorhub_set_algo_operation_mode( const uint8_t algo_op_mode )
{
	uint8_t Temp[1] = { algo_op_mode };
	int status = sh_set_algo_cfg(SS_ALGOIDX_WHRM_WSPO2_SUITE_OS6X, SS_CFGIDX_WHRM_WSPO2_BPT_OPERATION_MODE, &Temp[0], 1);

	return status;
}

int sensorhub_set_algo_submode( const uint8_t algo_op_mode , const uint8_t algo_op_submode )
{
	int status;
	uint8_t Temp[1] = { algo_op_submode };

	if(algo_op_mode == SH_OPERATION_WHRM_MODE)
	{
		status = sh_set_algo_cfg(SS_ALGOIDX_WHRM_WSPO2_SUITE_OS6X, SS_CFGIDX_WHRM_WSPO2_SUITE_ALGO_MODE, &Temp[0], 1);
	}
	else if(algo_op_mode == SH_OPERATION_WHRM_BPT_MODE ||  algo_op_mode == SH_OPERATION_BPT_MODE)
	{
		status = sh_set_algo_cfg(SS_ALGOIDX_WHRM_WSPO2_SUITE_OS6X, CFG_CFGIDX_BPT_ALGO_SUBMODE, &Temp[0], 1);  // DAVID : check here!
	}

	return status;
}

int sensorhub_enable_sensors()
{
	int ret = 0;

	ret = sh_sensor_enable_(SH_SENSORIDX_ACCEL, 1, SH_INPUT_DATA_DIRECT_SENSOR);
	g_algo_sensor_stat.accel_enabled = 1;
	if(0 == ret)
	{
		/* Enabling OS6X with host supplies data */
		ret = sh_sensor_enable_(SH_SENSORIDX_MAX86176, 1, SH_INPUT_DATA_DIRECT_SENSOR);
		g_algo_sensor_stat.max86176_enabled =1;
	}

	return ret;
}

int sensorhub_disable_sensor()
{
	int ret = 0;

	ret = sh_sensor_disable(SH_SENSORIDX_ACCEL);
	g_algo_sensor_stat.accel_enabled = 0;
	if(0 == ret)
	{
		/* Enabling OS6X with host supplies data */
		ret = sh_sensor_disable(SH_SENSORIDX_MAX86176);
		g_algo_sensor_stat.max86176_enabled = 0;
	}

	return ret;
}

int sensorhub_enable_algo(sensorhub_report_mode_t mode , int sh_operation_mode , int sh_algo_submode)
{
	int ret = 0;

	//MYG: setting algo mode will determine which is enabled
	g_algo_sensor_stat.bpt_algo_enabled = 0; //MYG: for MWA test

    //SH_OPERATION_WHRM_MODE here.
	ret = sensorhub_set_algo_operation_mode(sh_operation_mode);
#ifdef MAX_DEBUG	
	LOGD("set algo oper mode Ret:%d", ret);
#endif
	//if(ret < 0)
	//	return -1;  MYG: not define in regular sensorhub release

	ret = sensorhub_set_algo_submode(sh_operation_mode, sh_algo_submode);
#ifdef MAX_DEBUG
	LOGD("set algo submode Ret:%d", ret);
#endif

	ret = sh_enable_algo_(SS_ALGOIDX_WHRM_WSPO2_SUITE_OS6X, (int)mode);
#ifdef MAX_DEBUG
	LOGD("set algo enable Ret:%d", ret);
#endif
	if(ret < 0)
    	return -1;

	if(sh_operation_mode == SH_OPERATION_WHRM_MODE)
	{
		if(SENSORHUB_MODE_BASIC == mode)
		{
			g_algo_sensor_stat.whrm_wspo2_suite_enabled_mode1 = 1;
			g_algo_sensor_stat.whrm_wspo2_suite_enabled_mode2 = 0;
		}
		else
		{
			g_algo_sensor_stat.whrm_wspo2_suite_enabled_mode2 = 1;
			g_algo_sensor_stat.whrm_wspo2_suite_enabled_mode1 = 0;
		}

		g_algo_sensor_stat.bpt_algo_enabled = 0;
		g_algo_sensor_stat.algo_raw_enabled = 0;

	}
	else if(sh_operation_mode == SH_OPERATION_WHRM_BPT_MODE)
	{
		if(SENSORHUB_MODE_BASIC == mode)
		{
			g_algo_sensor_stat.whrm_wspo2_suite_enabled_mode1 = 1;
			g_algo_sensor_stat.whrm_wspo2_suite_enabled_mode2 = 0;
		}
		else
		{
			g_algo_sensor_stat.whrm_wspo2_suite_enabled_mode2 = 1;
			g_algo_sensor_stat.whrm_wspo2_suite_enabled_mode1 = 0;
		}

		g_algo_sensor_stat.bpt_algo_enabled = 1;
		g_algo_sensor_stat.algo_raw_enabled = 0;

	}
	else if(sh_operation_mode == SH_OPERATION_RAW_MODE)
	{
		g_algo_sensor_stat.whrm_wspo2_suite_enabled_mode1 = 0;
		g_algo_sensor_stat.whrm_wspo2_suite_enabled_mode2 = 0;
		g_algo_sensor_stat.bpt_algo_enabled = 0;
		g_algo_sensor_stat.algo_raw_enabled = 1;
	}

	return ret;
}

int sensorhub_disable_algo(void)
{
	int ret = 0;

	ret = sh_disable_algo(SS_ALGOIDX_WHRM_WSPO2_SUITE_OS6X);

	g_algo_sensor_stat.whrm_wspo2_suite_enabled_mode1 = 0;
	g_algo_sensor_stat.whrm_wspo2_suite_enabled_mode2 = 0;
	g_algo_sensor_stat.algo_raw_enabled = 0;
	g_algo_sensor_stat.bpt_algo_enabled = 0;

	return ret;
}

int sh_enable_algo_(int idx, int mode)
{
    uint8_t cmd_bytes[] = { 0x52, (uint8_t)idx, (uint8_t)mode };

	int status = sh_write_cmd_with_data(&cmd_bytes[0], sizeof(cmd_bytes), 0, 0, 50 * SS_ENABLE_SENSOR_SLEEP_MS);

	return status;
}

int sh_disable_algo(int idx)
{
	uint8_t ByteSeq[] = { 0x52, ((uint8_t) idx) , 0x00};

	int status = sh_write_cmd( &ByteSeq[0],sizeof(ByteSeq), SS_ENABLE_SENSOR_SLEEP_MS );

    return status;
}

int sh_set_algo_cfg(int algo_idx, int cfg_idx, uint8_t *cfg, int cfg_sz)
{
	uint8_t ByteSeq[] = { 0x50 , ((uint8_t) algo_idx) , ((uint8_t) cfg_idx) };

	int status = sh_write_cmd_with_data( &ByteSeq[0], sizeof(ByteSeq),
			                             cfg, cfg_sz,
										 SS_CMD_WAIT_PULLTRANS_MS);
	return status;
}

int sh_get_algo_cfg(int algo_idx, int cfg_idx, uint8_t *cfg, int cfg_sz)
{
	uint8_t ByteSeq[] = { 0x51 , ((uint8_t) algo_idx) , ((uint8_t) cfg_idx) };

	int status = sh_read_cmd(&ByteSeq[0], sizeof(ByteSeq),
						     0, 0,
							 cfg, cfg_sz,
							 SS_DEFAULT_CMD_SLEEP_MS);
	return status;
}

int sh_feed_to_input_fifo(uint8_t *tx_buf, int tx_buf_sz, int *nb_written)
{
	int status;

	uint8_t rxbuf[3];
	tx_buf[0] = 0x14;
	tx_buf[1] = 0x00;

	status= sh_read_cmd(tx_buf, tx_buf_sz,
			            0, 0,
			            rxbuf, sizeof(rxbuf), SS_FEEDFIFO_CMD_SLEEP_MS);

	*nb_written = rxbuf[1] * 256 + rxbuf[2];

	return status;
}


int sh_get_num_bytes_in_input_fifo(int *fifo_size)
{
    uint8_t ByteSeq[] = {0x13,0x04};
	uint8_t rxbuf[3]; /* status + fifo size */

	int status = sh_read_cmd(&ByteSeq[0], sizeof(ByteSeq),
							 0, 0,
							 rxbuf, sizeof(rxbuf),
							 2*SS_DEFAULT_CMD_SLEEP_MS);

	*fifo_size = rxbuf[1] << 8 | rxbuf[2];

	return status;
}

int sh_set_report_period(uint8_t period)
{
	uint8_t cmd_bytes[]  = { SS_FAM_W_COMMCHAN, SS_CMDIDX_REPORTPERIOD };
	uint8_t data_bytes[] = { (uint8_t)period };

	int status = sh_write_cmd_with_data(&cmd_bytes[0], sizeof(cmd_bytes),
								              &data_bytes[0], sizeof(data_bytes), SS_DEFAULT_CMD_SLEEP_MS );
	return status;
}


int sh_set_sensor_cfg(int sensor_idx, int cfg_idx, uint8_t *cfg, int cfg_sz, int sleep_ms)
{
	uint8_t cmd_bytes[] = { SS_FAM_W_SENSOR_CONFIG, (uint8_t)sensor_idx, (uint8_t)cfg_idx };
	int status = sh_write_cmd_with_data(&cmd_bytes[0], sizeof(cmd_bytes),
								 	 	 	 	  cfg, cfg_sz, sleep_ms   );
	return status;
}

int sh_disable_sensor_list(void)
{
	uint8_t cmd_bytes[] = { SS_FAM_W_SENSORMODE, 0xFF, 2, SH_SENSORIDX_ACCEL, 0, SH_INPUT_DATA_DIRECT_SENSOR, SH_SENSORIDX_MAX8614X, 0, SH_INPUT_DATA_DIRECT_SENSOR };

	int status = sh_write_cmd_with_data(&cmd_bytes[0], sizeof(cmd_bytes), 0, 0, 5 * SS_ENABLE_SENSOR_SLEEP_MS);

