duxinglang-1/nRF5340_test/N2_NCS2.7.0_TEST/src/ppg/max_sh_interface.c
	return status;
}


/*
 * BOOTLOADER RELATED FUNCTIONS
 *
 *
 * */

int32_t sh_exit_from_bootloader(void)
{
	return sh_set_sensorhub_operating_mode(0x00);
}

int32_t sh_put_in_bootloader(void)
{
	return sh_set_sensorhub_operating_mode(0x08);
}

int32_t sh_checkif_bootldr_mode(void)
{
	uint8_t hubMode;
	int status = sh_get_sensorhub_operating_mode(&hubMode);
	return (status != SS_SUCCESS)? -1:(hubMode & SS_MASK_MODE_BOOTLDR);
}

int32_t sh_get_bootloader_MCU_tye(uint8_t *type)
{
	uint8_t ByteSeq[]= { 0xFF, 0x00 };
    uint8_t rxbuf[2];

    int status = sh_read_cmd( &ByteSeq[0], sizeof(ByteSeq),
                          0, 0,
                          &rxbuf[0], sizeof(rxbuf),
						  SS_DEFAULT_CMD_SLEEP_MS);
    if (status == 0x00)
    {
    	*type = rxbuf[1];
    }
    else
    {
    	*type = -1;
    }

    return status;
}

int32_t sh_get_bootloader_pagesz(uint16_t *pagesz)
{
	uint8_t ByteSeq[]= { 0x81, 0x01 };
	uint8_t rxbuf[3];
	int sz = 0;

	int status = sh_read_cmd(&ByteSeq[0], sizeof(ByteSeq),
								0, 0,
								&rxbuf[0], sizeof(rxbuf),
								SS_DEFAULT_CMD_SLEEP_MS);
	if(status == 0x00)
	{
		sz = (256*(int)rxbuf[1]) + rxbuf[2];
		if(sz > BL_MAX_PAGE_SIZE )
		{
			sz = -2;
		}
	}

	*pagesz = sz;

	return status;
}

int32_t sh_set_bootloader_numberofpages(uint8_t pageCount)
{
    uint8_t ByteSeq[] = { 0x80, 0x02 };

    uint8_t data_bytes[] = { (uint8_t)((pageCount >> 8) & 0xFF), (uint8_t)(pageCount & 0xFF) };

    int status = sh_write_cmd_with_data(&ByteSeq[0], sizeof(ByteSeq),
								        &data_bytes[0], sizeof(data_bytes),
										SS_DEFAULT_CMD_SLEEP_MS );

    return status;
}

int32_t sh_set_bootloader_iv(uint8_t* iv_bytes)
{
	 uint8_t ByteSeq[] = { 0x80, 0x00 };

	 int status = sh_write_cmd_with_data( &ByteSeq[0], sizeof(ByteSeq),
			                              &iv_bytes[0], BL_AES_NONCE_SIZE ,
										  SS_DEFAULT_CMD_SLEEP_MS
										  );

     return status;
}


int32_t sh_set_bootloader_auth(uint8_t* auth_bytes)
{
	 uint8_t ByteSeq[] = { 0x80, 0x01 };

	 int status = sh_write_cmd_with_data( &ByteSeq[0], sizeof(ByteSeq),
			                              &auth_bytes[0], BL_AES_AUTH_SIZE,
										  SS_DEFAULT_CMD_SLEEP_MS
										  );

     return status;
}


int32_t sh_set_bootloader_partial_write_size(uint32_t partial_size)
{
    uint8_t ByteSeq[] = { 0x80, 0x06 };
    uint8_t data_bytes[] = { (uint8_t)((partial_size >> 8) & 0xFF), (uint8_t)(partial_size & 0xFF) };

    int status = sh_write_cmd_with_data(&ByteSeq[0], sizeof(ByteSeq),
								        &data_bytes[0], sizeof(data_bytes),
										SS_DEFAULT_CMD_SLEEP_MS );

    return status;
}


int32_t sh_set_bootloader_erase(void)
{
	uint8_t ByteSeq[] = { 0x80, 0x03 };

    int status = sh_write_cmd_with_data(&ByteSeq[0], sizeof(ByteSeq),
                                        0, 0,
										BL_ERASE_DELAY);

    return status;
}


#ifdef SH_OTA_DATA_STORE_IN_FLASH
uint8_t Fw_data[BL_FLASH_PARTIAL_SIZE];
int32_t sh_set_bootloader_flashpages(uint32_t FwData_addr, uint8_t u8_pageSize)
{
	int32_t status = -1;
    uint8_t ByteSeq[] = { 0x80, 0x04};
    uint32_t u32_dataIdx = 0;
    uint32_t u32_pageDataLen = (BL_MAX_PAGE_SIZE+BL_AES_AUTH_SIZE);

	for(uint32_t i = 0; i < u8_pageSize; i++)
	{
		u32_dataIdx = BL_ST_PAGE_IDEX + i * u32_pageDataLen;

		for(uint32_t j = 0; j < (1+(8000/BL_FLASH_PARTIAL_SIZE)); j++)
		{
			uint32_t part_index,part_len;

			part_index = BL_FLASH_PARTIAL_SIZE*j;
			part_len = BL_FLASH_PARTIAL_SIZE;
			if(j == (8000/BL_FLASH_PARTIAL_SIZE))
				part_len = 208;
			
			SpiFlash_Read(Fw_data, FwData_addr+u32_dataIdx+part_index, part_len);
			status = sh_write_cmd_with_data(&ByteSeq[0], sizeof(ByteSeq),
										  Fw_data, part_len,
										  BL_PAGE_W_DLY_TIME
										  );

			if(status != SS_SUCCESS)
			{
			#ifdef MAX_DEBUG
				LOGD("Write page %d part %d data FW fail: %x", i, j, status);
			#endif
				return status;
			}
		}
	#ifdef MAX_DEBUG
		LOGD("write page %d data done!", i);
	#endif
	}
	return status;
}

#else

int32_t sh_set_bootloader_flashpages(uint8_t *u8p_FwData , uint8_t u8_pageSize)
{
	int32_t status = -1;
    uint8_t ByteSeq[] = { 0x80, 0x04 };
    uint32_t u32_dataIdx = 0;
    uint32_t u32_pageDataLen = (BL_MAX_PAGE_SIZE+BL_AES_AUTH_SIZE);

	for(uint32_t i = 0; i < u8_pageSize; i++)
	{
		u32_dataIdx = BL_ST_PAGE_IDEX + i * u32_pageDataLen;

		status = sh_write_cmd_with_data( &ByteSeq[0], sizeof(ByteSeq),
										  &u8p_FwData[u32_dataIdx], u32_pageDataLen,
										  BL_PAGE_W_DLY_TIME
										  );

		if (status != SS_SUCCESS)
		{
		#ifdef MAX_DEBUG
			LOGD("Write page %d data FW fail: %x", i,  status);
		#endif
			return status;
		}
	#ifdef MAX_DEBUG
		LOGD("write  page %d data done", i);
	#endif
	}
	return status;
}
#endif

/* **********************************************************************************************
 * 																							   	*
 *   					   COMMAND INTERFACE for MAX86141    								 	*
 *																								*
 * **********************************************************************************************/
int SH_Max8614x_set_ppgreg(const uint8_t addr, const uint32_t val)
{
	int status = sh_set_reg(SH_SENSORIDX_MAX8614X, addr, val, 1);
	return status;
}


int SH_Max8614x_get_ppgreg(const uint8_t addr , uint32_t *regVal)
{
    int status = sh_get_reg(SH_SENSORIDX_MAX8614X, (uint8_t) addr, regVal);
	return status;
}

int sh_set_cfg_wearablesuite_aecenable(const uint8_t isAecEnable )
{
	uint8_t Temp[1] = { isAecEnable };
    int status = sh_set_algo_cfg(SS_ALGOIDX_WHRM_WSPO2_SUITE, SS_CFGIDX_WHRM_WSPO2_SUITE_AEC_ENABLE, &Temp[0], 1);
	return status;

}

int sh_get_cfg_wearablesuite_aecenable( uint8_t *isAecEnable )
{
	uint8_t rxBuff[1+1]; // first byte is status
	int status = sh_set_algo_cfg(SS_ALGOIDX_WHRM_WSPO2_SUITE, SS_CFGIDX_WHRM_WSPO2_SUITE_AEC_ENABLE, &rxBuff[0], sizeof(rxBuff) );
	*isAecEnable =  rxBuff[1];

	return status;
}

/*
 *  Sensorhub Authentication Related Functions
 *
 *
 */
int sh_get_dhparams( uint8_t *response, int response_sz)
{
	uint8_t cmd_bytes[] = { SS_FAM_R_INITPARAMS , (uint8_t) 0x00 };

