duxinglang-1/nRF5340_test/N2_NCS2.7.0_TEST/src/ppg/max_sh_interface.c
	int status = sh_read_cmd(&cmd_bytes[0], sizeof(cmd_bytes),
								0, 0,
								response, response_sz, SS_DEFAULT_CMD_SLEEP_MS);

	return status;
}

int sh_set_dhlocalpublic(  uint8_t *response , int response_sz)
{
	uint8_t cmd_bytes[] = { SS_FAM_W_DHPUBLICKEY, (uint8_t) 0x00 };
	int status = sh_write_cmd_with_data(&cmd_bytes[0], sizeof(cmd_bytes),
								        response, response_sz, SS_DEFAULT_CMD_SLEEP_MS);
	return status;
}


int sh_get_dhremotepublic( uint8_t *response, int response_sz)
{
	uint8_t cmd_bytes[] = { SS_FAM_R_DHPUBLICKEY , (uint8_t) 0x00 };

	int status = sh_read_cmd(&cmd_bytes[0], sizeof(cmd_bytes),
											0, 0,
											response, response_sz, SS_DEFAULT_CMD_SLEEP_MS);

	return status;
}

int sh_get_authentication( uint8_t *response, int response_sz)
{
//	const int auth_cfg_sz = 32; // fixed to 32 bytes

	uint8_t cmd_bytes[] = { SS_FAM_R_AUTHSEQUENCE , (uint8_t) 0x00 };

	int status = sh_read_cmd(&cmd_bytes[0], sizeof(cmd_bytes),
								   0, 0,
								   response, response_sz, SS_DEFAULT_CMD_SLEEP_MS);

	return status;
}

bool sh_init_interface(void)
{
	int32_t s32_status;
	uint8_t u8_rxbuf[3] = {0};
	uint8_t mcu_type;
	uint8_t buffer[64] = {0};

	sh_init_i2c();
	sh_init_gpio();

	SH_rst_to_APP_mode();

	//check MCU type
	s32_status = sh_get_bootloader_MCU_tye(u8_rxbuf);
	if(s32_status != SS_SUCCESS)
	{
	#ifdef MAX_DEBUG
		LOGD("Read MCU type fail, %x", s32_status);
	#endif

		goto end;
	}
#ifdef MAX_DEBUG	
	LOGD("MCU type = %d", u8_rxbuf[0]);
#endif
	mcu_type = u8_rxbuf[0];
	
	s32_status = sh_get_hub_fw_version(u8_rxbuf);
	if (s32_status != SS_SUCCESS)
	{
	#ifdef MAX_DEBUG
		LOGD("read FW version fail %x", s32_status);
	#endif

		goto end;
	}
	else
	{
		sprintf(g_ppg_ver, "%d.%d.%d", u8_rxbuf[0], u8_rxbuf[1], u8_rxbuf[2]);
	#ifdef MAX_DEBUG
		LOGD("FW version is:%s", g_ppg_ver);
	#endif
	}

end:
	if(s32_status != SS_SUCCESS)
		sprintf(buffer, "%s", COM_PPG_SET_CLOSE);
	else
		sprintf(buffer, "%s%s", COM_PPG_GET_INFOR, g_ppg_ver);
	
	MapcsSendData(UART_DATA_PPG, buffer, strlen(buffer));
	
	PPG_Disable();
	return true;
}


void sh_get_BL_version(void)
{
	int32_t s32_status;
	uint8_t u8_rxbuf[3] = {0,0,0};

	SH_rst_to_BL_mode();

	//check MCU type
	s32_status = sh_get_bootloader_MCU_tye(u8_rxbuf);
	if(s32_status != SS_SUCCESS)
	{
	#ifdef MAX_DEBUG
		LOGD("Read MCU type fail, %x", s32_status);
	#endif
	}
#ifdef MAX_DEBUG	
	LOGD("MCU type = %d", u8_rxbuf[0]);
#endif

	s32_status = sh_get_hub_fw_version(u8_rxbuf);
	if (s32_status != SS_SUCCESS)
	{
	#ifdef MAX_DEBUG
		LOGD("read FW version fail %x", s32_status);
	#endif
	}
	else
	{
	#ifdef MAX_DEBUG
		LOGD("FW version is %d.%d.%d", u8_rxbuf[0], u8_rxbuf[1], u8_rxbuf[2]);
	#endif
	}

	uint32_t u32_sensorID = 0;
	s32_status = sh_get_reg(0x0, 0xFF, &u32_sensorID);
	if(s32_status != SS_SUCCESS)
	{
	#ifdef MAX_DEBUG
		LOGD("read MAX86141 ID fail, %x", s32_status);
	#endif
	}
	else
	{
	#ifdef MAX_DEBUG
		LOGD("sensor MAX86141 ID = %x", u32_sensorID);
	#endif
	}

	uint32_t u32_accSensorId = 0;
	s32_status = sh_get_reg(SH_SENSORIDX_ACCEL, 0xF, &u32_accSensorId);
	if (s32_status != SS_SUCCESS)
	{
	#ifdef MAX_DEBUG
		LOGD("read acc sensor ID fail %x", s32_status);
	#endif
	}
	else
	{
	#ifdef MAX_DEBUG
		LOGD("acc sensor ID is %x", u32_accSensorId);
	#endif
	}
}

void sh_get_APP_version(void)
{
	int32_t s32_status;
	uint8_t u8_rxbuf[3];

	SH_rst_to_APP_mode();

	//check MCU type
	s32_status = sh_get_bootloader_MCU_tye(u8_rxbuf);
	if(s32_status != SS_SUCCESS)
	{
	#ifdef MAX_DEBUG
		LOGD("Read MCU type fail, %x", s32_status);
	#endif
	}
#ifdef MAX_DEBUG
	LOGD("MCU type = %d", u8_rxbuf[0]);
#endif

	s32_status = sh_get_hub_fw_version(u8_rxbuf);
	if (s32_status != SS_SUCCESS)
	{
	#ifdef MAX_DEBUG
		LOGD("read FW version fail %x", s32_status);
	#endif
	}
	else
	{
	#ifdef MAX_DEBUG
		LOGD("FW version is %d.%d.%d", u8_rxbuf[0], u8_rxbuf[1], u8_rxbuf[2]);
	#endif
	}

	uint32_t u32_sensorID = 0;
	s32_status = sh_get_reg(0x0, 0xFF, &u32_sensorID);
	if(s32_status != SS_SUCCESS)
	{
	#ifdef MAX_DEBUG
		LOGD("read MAX86141 ID fail, %x", s32_status);
	#endif
	}
	else
	{
	#ifdef MAX_DEBUG
		LOGD("sensor MAX86141 ID = %x", u32_sensorID);
	#endif
	}

	uint32_t u32_accSensorId = 0;
	s32_status = sh_get_reg(SH_SENSORIDX_ACCEL, 0xF, &u32_accSensorId);
	if (s32_status != SS_SUCCESS)
	{
	#ifdef MAX_DEBUG
		LOGD("read acc sensor ID fail %x", s32_status);
	#endif
	}
	else
	{
	#ifdef MAX_DEBUG
		LOGD("acc sensor ID is %x", u32_accSensorId);
	#endif
	}
}

bool sh_clear_bpt_cal_data(void)
{
	memset(&sh_bpt_cal, 0x00, CAL_RESULT_SIZE);
	//SpiFlash_Write(sh_bpt_cal, PPG_BPT_CAL_DATA_ADDR, PPG_BPT_CAL_DATA_SIZE);
}

bool sh_check_bpt_cal_data(void)
{
	//SpiFlash_Read(sh_bpt_cal, PPG_BPT_CAL_DATA_ADDR, PPG_BPT_CAL_DATA_SIZE);

	if((sh_bpt_cal[0] == 0x4f)&&(sh_bpt_cal[1] == 0x3c)&&(sh_bpt_cal[2] == 0x34)&&(sh_bpt_cal[3] == 0x01))
		return true;
	else
		return false;
}

void sh_get_bpt_cal_data(void)
{
	int status;
	
	status = sh_get_cfg_bpt_cal_result(&sh_bpt_cal);
	//SpiFlash_Write(sh_bpt_cal, PPG_BPT_CAL_DATA_ADDR, PPG_BPT_CAL_DATA_SIZE);
}

void sh_req_bpt_cal_data(void)
{
	int status;

	//Enable AEC
	status = sh_set_cfg_wearablesuite_afeenable(1);
#ifdef MAX_DEBUG
	LOGD("enabel aec ret:%d", status);
#endif
	//Enable automatic calculation of target PD current
	status = sh_set_cfg_wearablesuite_autopdcurrentenable(1);
#ifdef MAX_DEBUG
	LOGD("enabel auto pd cur ret:%d", status);
#endif
	//Set minimum PD current to 12.5uA
	status = sh_set_cfg_wearablesuite_minpdcurrent(125);
#ifdef MAX_DEBUG
	LOGD("set min pd cur ret:%d", status);
#endif
	//Set initial PD current to 31.2uA
	status = sh_set_cfg_wearablesuite_initialpdcurrent(312);
#ifdef MAX_DEBUG
	LOGD("set init pd cur ret:%d", status);
#endif
	//Set target PD current to 31.2uA
	status = sh_set_cfg_wearablesuite_targetpdcurrent(312);
#ifdef MAX_DEBUG
	LOGD("set target pd cur ret:%d", status);
#endif
	//Enable SCD
	status = sh_set_cfg_wearablesuite_scdenable(1);
#ifdef MAX_DEBUG
	LOGD("enable scd ret:%d", status);
#endif
	//Set the output format to Sample Counter byte, Sensor Data and Algorithm
	status = sh_set_data_type(SS_DATATYPE_BOTH, true);
#ifdef MAX_DEBUG
	LOGD("set output format ret:%d", status);
#endif
	//set fifo thresh
	status = sh_set_fifo_thresh(1);
#ifdef MAX_DEBUG
	LOGD("set fifo thresh ret:%d", status);	
#endif
	//Set the samples report period to 40ms(minimum is 32ms for BPT).
	status = sh_set_report_period(25);
#ifdef MAX_DEBUG
	LOGD("set samples period ret:%d", status);	
#endif
	//Enable the sensor.
	status = sensorhub_enable_sensors();
#ifdef MAX_DEBUG
	LOGD("enabel sensor ret:%d", status);
#endif
	//set algo mode
	status = sh_set_cfg_wearablesuite_algomode(0x0);
#ifdef MAX_DEBUG
	LOGD("set algo mode Ret:%d", status);
#endif
	//set algo oper mode
	status = sensorhub_set_algo_operation_mode(SH_OPERATION_WHRM_BPT_MODE);
	g_algo_sensor_stat.bpt_algo_enabled = 1;
#ifdef MAX_DEBUG
	LOGD("set algo oper mode Ret:%d", status);
#endif
	//Set the cal_index, reference systolic, reference diastolic
	status = sh_set_cfg_bpt_sys_dia(0, global_settings.bp_calibra.systolic, global_settings.bp_calibra.diastolic);
#ifdef MAX_DEBUG
	LOGD("set cal_index sys:%d&dia:%d ret:%d", global_settings.bp_calibra.systolic, global_settings.bp_calibra.diastolic, status);
#endif
	//set algo submode
	status = sensorhub_set_algo_submode(SH_OPERATION_WHRM_BPT_MODE, SH_BPT_MODE_CALIBCATION);
#ifdef MAX_DEBUG
	LOGD("set algo submode Ret:%d", status);
#endif
	//enable algo
	status = sh_enable_algo_(SS_ALGOIDX_WHRM_WSPO2_SUITE_OS6X, SENSORHUB_MODE_BASIC);
	g_algo_sensor_stat.whrm_wspo2_suite_enabled_mode1 = 1;
#ifdef MAX_DEBUG
	LOGD("set algo enable Ret:%d", status);
#endif
}

void sh_set_bpt_cal_data(void)
{
	int status;

