duxinglang-1/nRF5340_test/N2_NCS2.7.0_TEST/src/ppg/max_sh_interface.c
	//Set the the cal_index to 0.
	status = sh_set_cfg_bpt_cal_index(0);
#ifdef MAX_DEBUG
	LOGD("Set the the cal_index to 0 ret:%d", status);
#endif
	//Set the BPT user calibration vector (using cal_index 0).
	status = sh_set_cfg_bpt_cal_result(&sh_bpt_cal[0*CAL_RESULT_SIZE]);
#ifdef MAX_DEBUG
	LOGD("Set the BPT user calibration vector ret:%d", status);
#endif

#if 0
	//Set the the cal_index to 1.
	status = sh_set_cfg_bpt_cal_index(1);
#ifdef MAX_DEBUG
	LOGD("Set the the cal_index to 1 ret:%d", status);
#endif
	//Set the BPT user calibration vector (using cal_index 1).
	status = sh_set_cfg_bpt_cal_result(&sh_bpt_cal[0*CAL_RESULT_SIZE]);
#ifdef MAX_DEBUG
	LOGD("Set the BPT user calibration vector ret:%d", status);
#endif
	//Set the the cal_index to 2.
	status = sh_set_cfg_bpt_cal_index(2);
#ifdef MAX_DEBUG
	LOGD("Set the the cal_index to 2 ret:%d", status);
#endif
	//Set the BPT user calibration vector (using cal_index 2).
	status = sh_set_cfg_bpt_cal_result(&sh_bpt_cal[0*CAL_RESULT_SIZE]);
#ifdef MAX_DEBUG
	LOGD("Set the BPT user calibration vector ret:%d", status);
#endif
	//Set the the cal_index to 3.
	status = sh_set_cfg_bpt_cal_index(3);
#ifdef MAX_DEBUG
	LOGD("Set the the cal_index to 3 ret:%d", status);
#endif
	//Set the BPT user calibration vector (using cal_index 3).
	status = sh_set_cfg_bpt_cal_result(&sh_bpt_cal[0*CAL_RESULT_SIZE]);
#ifdef MAX_DEBUG
	LOGD("Set the BPT user calibration vector ret:%d", status);
#endif
	//Set the the cal_index to 4.
	status = sh_set_cfg_bpt_cal_index(4);
#ifdef MAX_DEBUG
	LOGD("Set the the cal_index to 4 ret:%d", status);
#endif
	//Set the BPT user calibration vector (using cal_index 4).
	status = sh_set_cfg_bpt_cal_result(&sh_bpt_cal[0*CAL_RESULT_SIZE]);	
#ifdef MAX_DEBUG
	LOGD("Set the BPT user calibration vector ret:%d", status);
#endif
#endif	
}
